In [46]:
import pandas as pd

In [47]:
df = pd.read_csv("universities.csv")
df

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,"35,000",https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,"85,000",https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,"29,827",https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,"311,175",https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,"73,807",https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...
64,Turkey,Anadolu University,1958,Public,"1,969,733",https://en.wikipedia.org/wiki/Anadolu_University
65,United Kingdom,Open University,1969,Public,"253,075",https://en.wikipedia.org/wiki/Open_University
66,United States,Texas A&M University,1876,Public,"73,284",https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
67,Uruguay,University of the Republic,1949,Public,"144,108",https://en.wikipedia.org/wiki/University_of_th...
68,Venezuela,Universidad Central de Venezuela,1721,Public,"41,059",https://en.wikipedia.org/wiki/Universidad_Cent...

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     69 non-null     object
 1   University  69 non-null     object
 2   Founded     69 non-null     object
 3   Type        69 non-null     object
 4   Enrollment  69 non-null     object
 5   Link        69 non-null     object
dtypes: object(6)
memory usage: 3.4+ KB

In [49]:
df.shape

(69, 6)

In [50]:
df["Founded"].values

array(['1957', '1978', '1962', '1821', '1958', '1365', '1992', '1921',
       '1425', '1949', '1982', '1970', '1888', '1827', '1960', '1867',
       '1940', '1669', '1928', '1538', '1950', '1640', '1939', '1998',
       '1837', '1676', '1937', '1911', '1985', '1984', '1982', '1834',
       '1956', '1303', '1889', '1970', '1999', '1579', '2000', '1956',
       '1551', '1959', '1632', '1883', '1943', '1996', '2002', '1551',
       '1904', '1816', '1288', '1991', '1992', '1976', '1905', '1919',
       '1873', '1972', '1972', '1666', '1833[34]', '1928', '1971', '1960',
       '1958', '1969', '1876', '1949', '1721'], dtype=object)

In [51]:
df['Founded'].str.extract("(\d{4})")

       0
0   1957
1   1978
2   1962
3   1821
4   1958
..   ...
64  1958
65  1969
66  1876
67  1949
68  1721

[69 rows x 1 columns]

In [52]:
df['Founded'] = df['Founded'].str.extract("(\d{4})")

In [53]:
df['Founded'].values

array(['1957', '1978', '1962', '1821', '1958', '1365', '1992', '1921',
       '1425', '1949', '1982', '1970', '1888', '1827', '1960', '1867',
       '1940', '1669', '1928', '1538', '1950', '1640', '1939', '1998',
       '1837', '1676', '1937', '1911', '1985', '1984', '1982', '1834',
       '1956', '1303', '1889', '1970', '1999', '1579', '2000', '1956',
       '1551', '1959', '1632', '1883', '1943', '1996', '2002', '1551',
       '1904', '1816', '1288', '1991', '1992', '1976', '1905', '1919',
       '1873', '1972', '1972', '1666', '1833', '1928', '1971', '1960',
       '1958', '1969', '1876', '1949', '1721'], dtype=object)

In [54]:
df['Founded'] = df['Founded'].astype(int)

In [55]:
df['Founded'].values

array([1957, 1978, 1962, 1821, 1958, 1365, 1992, 1921, 1425, 1949, 1982,
       1970, 1888, 1827, 1960, 1867, 1940, 1669, 1928, 1538, 1950, 1640,
       1939, 1998, 1837, 1676, 1937, 1911, 1985, 1984, 1982, 1834, 1956,
       1303, 1889, 1970, 1999, 1579, 2000, 1956, 1551, 1959, 1632, 1883,
       1943, 1996, 2002, 1551, 1904, 1816, 1288, 1991, 1992, 1976, 1905,
       1919, 1873, 1972, 1972, 1666, 1833, 1928, 1971, 1960, 1958, 1969,
       1876, 1949, 1721])

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     69 non-null     object
 1   University  69 non-null     object
 2   Founded     69 non-null     int64
 3   Type        69 non-null     object
 4   Enrollment  69 non-null     object
 5   Link        69 non-null     object
dtypes: int64(1), object(5)
memory usage: 3.4+ KB

In [57]:
#to find the row that has a missing link in the link column.
df[df['Link'].isnull()]

Empty DataFrame
Columns: [Country, University, Founded, Type, Enrollment, Link]
Index: []

In [58]:
df['Enrollment'].values

array(['35,000', '85,000', '29,827', '311,175', '73,807', '91,000',
       '2,097,182', '25,500', '55,484', '30,866', '32,000', '215,000',
       '18 911', '84,000', '80,000', '53,581', '42,750', '72,480',
       '43,600', '170,530', '170,000', '36,500', '350,000[8]', '130,000',
       '104,000', '124,000', '32,000', '13,782', '7,140,000',
       '1,045,665 (total) as per 2019/2020[14]\n311,028 (active) as per 4 November 2020 [15]',
       '1,000,000', '32,900', '26,023', '112,564', '70,667', '84,000',
       '41,833', '23,606', '10,373', '100,000', '349,515', '604,437',
       '31,186', '33,050', '50,000', '39,000', '165,000', '37,032',
       '68,249', '44,400', '48,100', '311,928', '200,000', '177,234',
       '38,300', '48,821', '328,179', '173,758', '260,079', '30,646',
       '26,356', '31,758', '525,000', '60,000+', '1,969,733', '253,075',
       '73,284', '144,108', '41,059'], dtype=object)

In [59]:
df['Enrollment'] = df['Enrollment'].str.replace(' ',',')

In [60]:
df['Enrollment'].values

array(['35,000', '85,000', '29,827', '311,175', '73,807', '91,000',
       '2,097,182', '25,500', '55,484', '30,866', '32,000', '215,000',
       '18,911', '84,000', '80,000', '53,581', '42,750', '72,480',
       '43,600', '170,530', '170,000', '36,500', '350,000[8]', '130,000',
       '104,000', '124,000', '32,000', '13,782', '7,140,000',
       '1,045,665,(total),as,per,2019/2020[14]\n311,028,(active),as,per,4,November,2020,[15]',
       '1,000,000', '32,900', '26,023', '112,564', '70,667', '84,000',
       '41,833', '23,606', '10,373', '100,000', '349,515', '604,437',
       '31,186', '33,050', '50,000', '39,000', '165,000', '37,032',
       '68,249', '44,400', '48,100', '311,928', '200,000', '177,234',
       '38,300', '48,821', '328,179', '173,758', '260,079', '30,646',
       '26,356', '31,758', '525,000', '60,000+', '1,969,733', '253,075',
       '73,284', '144,108', '41,059'], dtype=object)

In [61]:
df['Enrollment'].str.extract("(\d{1,3}(?:,\d{1,3})*)")

            0
0      35,000
1      85,000
2      29,827
3     311,175
4      73,807
..        ...
64  1,969,733
65    253,075
66     73,284
67    144,108
68     41,059

[69 rows x 1 columns]

In [62]:
df['Enrollment'] = df['Enrollment'].str.extract("(\d{1,3}(?:,\d{1,3})*)")

In [63]:
df['Enrollment'].values

array(['35,000', '85,000', '29,827', '311,175', '73,807', '91,000',
       '2,097,182', '25,500', '55,484', '30,866', '32,000', '215,000',
       '18,911', '84,000', '80,000', '53,581', '42,750', '72,480',
       '43,600', '170,530', '170,000', '36,500', '350,000', '130,000',
       '104,000', '124,000', '32,000', '13,782', '7,140,000', '1,045,665',
       '1,000,000', '32,900', '26,023', '112,564', '70,667', '84,000',
       '41,833', '23,606', '10,373', '100,000', '349,515', '604,437',
       '31,186', '33,050', '50,000', '39,000', '165,000', '37,032',
       '68,249', '44,400', '48,100', '311,928', '200,000', '177,234',
       '38,300', '48,821', '328,179', '173,758', '260,079', '30,646',
       '26,356', '31,758', '525,000', '60,000', '1,969,733', '253,075',
       '73,284', '144,108', '41,059'], dtype=object)

In [64]:
df['Enrollment'] = df['Enrollment'].str.replace(',','')

In [66]:
df['Enrollment'].values

array(['35000', '85000', '29827', '311175', '73807', '91000', '2097182',
       '25500', '55484', '30866', '32000', '215000', '18911', '84000',
       '80000', '53581', '42750', '72480', '43600', '170530', '170000',
       '36500', '350000', '130000', '104000', '124000', '32000', '13782',
       '7140000', '1045665', '1000000', '32900', '26023', '112564',
       '70667', '84000', '41833', '23606', '10373', '100000', '349515',
       '604437', '31186', '33050', '50000', '39000', '165000', '37032',
       '68249', '44400', '48100', '311928', '200000', '177234', '38300',
       '48821', '328179', '173758', '260079', '30646', '26356', '31758',
       '525000', '60000', '1969733', '253075', '73284', '144108', '41059'],
      dtype=object)

In [67]:
df['Enrollment'] = df['Enrollment'].astype(int)

In [68]:
df['Enrollment'].values

array([  35000,   85000,   29827,  311175,   73807,   91000, 2097182,
         25500,   55484,   30866,   32000,  215000,   18911,   84000,
         80000,   53581,   42750,   72480,   43600,  170530,  170000,
         36500,  350000,  130000,  104000,  124000,   32000,   13782,
       7140000, 1045665, 1000000,   32900,   26023,  112564,   70667,
         84000,   41833,   23606,   10373,  100000,  349515,  604437,
         31186,   33050,   50000,   39000,  165000,   37032,   68249,
         44400,   48100,  311928,  200000,  177234,   38300,   48821,
        328179,  173758,  260079,   30646,   26356,   31758,  525000,
         60000, 1969733,  253075,   73284,  144108,   41059])

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     69 non-null     object
 1   University  69 non-null     object
 2   Founded     69 non-null     int64
 3   Type        69 non-null     object
 4   Enrollment  69 non-null     int64
 5   Link        69 non-null     object
dtypes: int64(2), object(4)
memory usage: 3.4+ KB

In [74]:
df['Country'].values

array(['Albania', 'Algeria', 'Angola', 'Argentina', 'Australia',
       'Austria', 'Bangladesh', 'Belarus', 'Belgium',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Bulgaria',
       'Canada', 'China', 'Colombia', 'Costa Rica', 'Croatia', 'Denmark',
       'Dominican Republic', 'Egypt', 'Finland', 'France', 'Germany',
       'Greece', 'Guatemala', 'Hong Kong', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Ireland', 'Israel', 'Italy', 'Japan',
       'Kenya', 'Kosovo', 'Lithuania', 'Macau', 'Malaysia', 'Mexico',
       'Nepal', 'Netherlands', 'New Zealand', 'North Macedonia', 'Norway',
       'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Romania',
       'Russia', 'Saudi Arabia', 'Singapore', 'Slovenia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan',
       'Thailand', 'Trinidad and Tobago', 'Turkey', 'United Kingdom',
       'United States', 'Uruguay', 'Venezuela'], dtype=object)

In [75]:
df.shape

(69, 6)

In [76]:
df.to_csv('cleaned_universities.csv', index=False)